Спортклуб/src/Documents/РегистрацияДоходовИРасходов/РегистрацияДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияДоходовИРасходов</name>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>СтатьяДоходаИРасхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Спортклуб/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПоСтатье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ДоходыИРасходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидСтатьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Спортклуб/src/Documents/РегистрацияДоходовИРасходов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ
    |  РегистрацияДоходовИРасходов.СтатьяДоходаИРасхода КАК Статья,
    |  РегистрацияДоходовИРасходов.СтатьяДоходаИРасхода.Вид КАК Вид,
    |  РегистрацияДоходовИРасходов.Сумма КАК СуммаПоСтатье,
    |  РегистрацияДоходовИРасходов.Дата КАК Период

    |ИЗ
    |  Документ.РегистрацияДоходовИРасходов КАК РегистрацияДоходовИРасходов
    |ГДЕ
    |  РегистрацияДоходовИРасходов.Ссылка = &Ссылка";
  
  Запрос.УстановитьПараметр("Ссылка", Ссылка);
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  
  Движения.ДоходыИРасходы.Записывать = Истина;
  
  Пока ВыборкаДетальныеЗаписи.Следующий()Цикл
//    Движение = Движения.ДоходыИРасходы.Добавить();
    ЗаполнитьЗначенияСвойств(Движения.ДоходыИРасходы.Добавить(), ВыборкаДетальныеЗаписи);
//    Движение.Период = Ссылка.Дата;
  КонецЦикла;
КонецПроцедуры
